"""
Ваша програма повинна вміти розділяти один список на два та помістити їх у новий список.
Тобто, в результаті повинен вийти список із 2-х списків.
Якщо в початковому списку непарна кількість елементів, то в першому списку має бути більше елементів.

Якщо у списку немає елементів, то має бути створений список із двома порожніми списками.

Важливо! Потрібно створити рішення, яке обробляє 3 випадки - список порожній,
у списку парна кількість елементів і в списку непарна кількість елементів.
"""
my_list = [1, 2, 3, 4, 5]
divide_list = (len(my_list) + 1) //2
result = my_list[:divide_list], my_list[divide_list:]
print(result)
